_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменДаннымиСмета3_0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_ОбменДаннымиСмета3_0</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_Файлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменДаннымиСмета3_0/Forms/Форма/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

Перем ТаблицаСсылок;

&НаКлиенте
Функция ЗаписатьАрхив()
	
	ИмяАрхива	= ЭтаФорма.КаталогВыгрузки + НСтр("ru='\Выгрузка данных.zip'"); 
	Архиватор 	= Новый ЗаписьZipФайла(ИмяАрхива,,Нстр("ru = 'Файл обмена данными'"));
	Для Каждого ФайлЗаписи Из ТаЗ Цикл 
		Архиватор.Добавить(ФайлЗаписи.Файл);
	КонецЦикла;
	
	Архиватор.Записать();
	
КонецФункции

&НаСервере
Процедура ВыгрузитьДокументыНаСервере(ДокументДляВыгрузки,АдресФайлаВоВременномХранилище)
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ТаблицаВыгрузкиВрем = РеквизитФормыВЗначение("ТаблицаВыгрузки",Тип("ТаблицаЗначений"));
	ТаЗВрем = РеквизитФормыВЗначение("ТаЗ",Тип("ТаблицаЗначений"));
	ОбъектВрем = РеквизитФормыВЗначение("Объект");
	ОбъектВрем.ВыгрузитьДокументы(ДокументДляВыгрузки,ТаблицаВыгрузкиВрем, ТаблицаСсылок, ТаЗВрем, КаталогВыгрузки,АдресФайлаВоВременномХранилище,ИмяВременногоФайла);
	
	ЗначениеВРеквизитФормы(ТаблицаВыгрузкиВрем,"ТаблицаВыгрузки");
	ЗначениеВРеквизитФормы(ТаЗВрем,"ТаЗ");
			
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДокументы(Команда)
	ТаЗ.Очистить();	
	Если (ТаблицаДокументов.Количество() > 0) Тогда 
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.КаталогВыгрузки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не задан каталог выгрузки!'"));	
		Иначе 
			Для каждого стр Из ТаблицаДокументов Цикл 
				АдресФайлаВоВременномХранилище = "";
				ВыгрузитьДокументыНаСервере(стр.Документ,АдресФайлаВоВременномХранилище);
				Для Каждого ключ Из АдресФайлаВоВременномХранилище Цикл
					ПолучитьФайл(ключ.Значение,ключ.Ключ,Ложь);
				КонецЦикла;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Документ %1 Выгружен'"), стр.Документ));	
			КонецЦикла;
			ЗаписатьАрхив();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Архив сформирован'"));	
	  	КонецЕсли;
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не Выбраны документы для выгрузки!'"));	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	// Синхронный вызов
	//Если ДиалогВыбора.Выбрать() Тогда
	//	ЭтаФорма.КаталогВыгрузки = ДиалогВыбора.Каталог;
	//КонецЕсли;		
	
	// Замена на асинхронный вызов
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект);
	ДиалогВыбора.Показать(ОповещениеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайла(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			ЭтаФорма.КаталогВыгрузки = ТекЭлемент;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	ТаблицаСсылок = Новый ТаблицаЗначений;
	ТаблицаСсылок.Колонки.Добавить("Ссылка");	
	ТаблицаСсылок.Колонки.Добавить("НаименованиеОбъекта");	
	ТаблицаСсылок.Колонки.Добавить("НаименованиеПолное");	
	ТаблицаСсылок.Колонки.Добавить("ТипОбъекта");	
	ТаблицаСсылок.Колонки.Добавить("НомерПоПорядку");	
	
	Если Параметры.Свойство("Документ") Тогда
		Если ЗначениеЗаполнено(Параметры.Документ) Тогда
			НоваяСтрока 			= ЭтаФорма.ТаблицаДокументов.Добавить();
			НоваяСтрока.Документ	= Параметры.Документ;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Загрузка") Тогда
		Если Параметры.Загрузка Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗагрузка;
		КонецЕсли;
	КонецЕсли;
	
	ВыводитьКомментарии = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДокументыНаСервере()
	
	Запись = РегистрыСведений.СМ_Файлы.СоздатьМенеджерЗаписи();
	Запись.ИмяФайла = ЭтаФорма.ФайлЗагрузки;
	Запись.Файл = Новый ХранилищеЗначения(ПолучитьИЗВременногоХранилища(ЭтаФорма.Загрузка_АдресВременногоХранилища));
	Запись.Записать();

	ТЗЗагрузки = Новый ТаблицаЗначений;
	ТЗЗагрузки.Колонки.Добавить("Ссылка");
	
	ОбъектВрем = РеквизитФормыВЗначение("Объект");
	ОбъектВрем.ЗагрузитьДокументы(ЭтаФорма.ФайлЗагрузки,ТЗЗагрузки);
	
	ТаблицаЗагрузки.Загрузить(ТЗЗагрузки);

	Запись = РегистрыСведений.СМ_Файлы.Выбрать(Новый Структура("ИмяФайла",ЭтаФорма.ФайлЗагрузки)); 
	Запись.Следующий();
	Запись.ПолучитьМенеджерЗаписи().Удалить();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДокументыНаСервереВеб(Адрес)
	ТЗЗагрузки = Новый ТаблицаЗначений;
	ТЗЗагрузки.Колонки.Добавить("Ссылка");
	
	ОбъектВрем = РеквизитФормыВЗначение("Объект");
	ОбъектВрем.ЗагрузитьДокументыВеб(Адрес,ТЗЗагрузки);
	ТаблицаЗагрузки.Загрузить(ТЗЗагрузки)
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДокументы(Команда)
	#Если Не ВебКлиент Тогда	
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.ФайлЗагрузки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не задан файл для загрузки!'"));
			Возврат;
		КонецЕсли;
		
		ЗагрузитьДокументыНаСервере();
		Если этаформа.ВладелецФормы<>Неопределено Тогда
			Если этаформа.ВладелецФормы.ИмяФормы = "Обработка.СМ_ДеревоСмет.Форма.ФормаУпр" Тогда
				этаформа.ВладелецФормы.Элементы.СписокОбъектыСтроительства.обновить()
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	#Если ВебКлиент Тогда
		// Синхронный вызов
		//Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
		//	АдресВременногоХранилищаФайла = "";
		//	ИмяФайла = "";
		//	Оповещение = Новый ОписаниеОповещения("ПродолжитьЗагрузкуВеб", ЭтаФорма);
		//	НачатьПомещениеФайла(Оповещение,АдресВременногоХранилищаФайла,ИмяФайла,Истина,ЭтаФорма.УникальныйИдентификатор); 
		//КонецЕсли;
		
		// Замена на асинхронный вызов
		ОповещениеПодключенияРасширения = Новый ОписаниеОповещения("ВыполнитьПослеПодключенияРасширенияРаботыСФайлами", ЭтотОбъект);
		НачатьПодключениеРасширенияРаботыСФайлами(ОповещениеПодключенияРасширения); 
	#КонецЕсли
	Оповестить("ОбновитьДеревоСмет");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПодключенияРасширенияРаботыСФайлами(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Не Подключено Тогда
		АдресВременногоХранилищаФайла 	= "";
		ИмяФайла 						= "";
		Оповещение 						= Новый ОписаниеОповещения("ПродолжитьЗагрузкуВеб", ЭтаФорма);
		НачатьПомещениеФайла(Оповещение,АдресВременногоХранилищаФайла,ИмяФайла,Истина,ЭтаФорма.УникальныйИдентификатор); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗагрузкуВеб(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	ЗагрузитьДокументыНаСервереВеб(Адрес);
	Если ЭтаФорма.ВладелецФормы<>Неопределено Тогда
		Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Обработка.СМ_ДеревоСмет.Форма.ФормаУпр" Тогда
			ЭтаФорма.ВладелецФормы.Элементы.СписокОбъектыСтроительства.обновить()
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ФильтрДляДиалога = "Xml файл (*.xml)";
	Диалог.Фильтр = ФильтрДляДиалога;
	Если Диалог.Выбрать() Тогда
		ФайлЗагрузки = Диалог.ПолноеИмяФайла;
		ДвоичныеДанные = Новый ДвоичныеДанные(ФайлЗагрузки);
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		Загрузка_АдресВременногоХранилища = АдресВременногоХранилища;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		Элементы.КаталогВыгрузки.Видимость = Ложь;
		Элементы.ФайлЗагрузки.Видимость = Ложь;
	#КонецЕсли
	
	Если ЗначениеЗаполнено(Параметры.ИмяФайла) Тогда
		ФайлЗагрузки = Параметры.ИмяФайла;
		#Если Не ВебКлиент Тогда
			ДвоичныеДанные 						= Новый ДвоичныеДанные(ФайлЗагрузки);
			АдресВременногоХранилища 			= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
			Загрузка_АдресВременногоХранилища 	= АдресВременногоХранилища;
		    ЗагрузитьДокументыНаСервере();
		#КонецЕсли
		#Если ВебКлиент Тогда
			АдресВременногоХранилищаФайла = "";
			Оповещение = Новый ОписаниеОповещения("ПродолжитьЗагрузкуВеб", ЭтаФорма);
			НачатьПомещениеФайла(Оповещение,АдресВременногоХранилищаФайла,Параметры.ИмяФайла,Ложь,ЭтаФорма.УникальныйИдентификатор); 
		#КонецЕсли
		Оповестить("ОбновитьДеревоСмет");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеОЗакрытииФормыВыбораЛС = Новый ОписаниеОповещения("ПриЗакрытииФормыПодбораЛС",ЭтаФорма);
	СтруктураПараметров = Новый Структура("ВключатьОС,ВключатьСС",Истина,Истина);
	ОткрытьФорму("Обработка.СМ_ДеревоСметПростое.Форма.ФормаУпр",СтруктураПараметров,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораЛС,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыПодбораЛС(ТекЛС,ТекПараметр) Экспорт
	Если ТекЛС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ТаблицаДокументов.ТекущиеДанные.Документ = ТекЛС;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагрузкиСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти
